In [1]:
import pandas as pd

In [2]:
df_one = pd.DataFrame(columns=["Column 1", "Column 2"])
df_one

Empty DataFrame
Columns: [Column 1, Column 2]
Index: []

In [3]:
df_one = pd.DataFrame(columns=["ID #", "Height", "Weight", "BMI" ])
df_one

Empty DataFrame
Columns: [ID #, Height, Weight, BMI]
Index: []

In [4]:
new_data = {
    "ID #":[1, 2, 3],
    "Height":[56, 24, 63],
    "Weight":[125, 155, 105],
    "BMI":[25.0, 35.0,50.0]
}

df_two = pd.DataFrame(new_data)
df_two

   ID #  Height  Weight   BMI
0     1      56     125  25.0
1     2      24     155  35.0
2     3      63     105  50.0

In [5]:
df_combined = pd.concat([df_one, df_two])
df_combined

  ID # Height Weight   BMI
0    1     56    125  25.0
1    2     24    155  35.0
2    3     63    105  50.0

In [6]:
df_new = {
    "ID #": [4],
    "Height": [72],
    "Weight": [135],
    "BMI": [15.0]
}

df_three = pd.DataFrame(df_new)

df_combined = pd.concat([df_two, df_three])

df_combined.reset_index(drop=True, inplace=True)

df_combined

   ID #  Height  Weight   BMI
0     1      56     125  25.0
1     2      24     155  35.0
2     3      63     105  50.0
3     4      72     135  15.0

In [7]:
new_column_data ={
    "Name":["Jojo", "Coco", "Melon"]
}

df_three = pd.DataFrame(new_column_data)
df_combined = pd.concat([ df_combined, df_three], axis=1)
df_combined

   ID #  Height  Weight   BMI   Name
0     1      56     125  25.0   Jojo
1     2      24     155  35.0   Coco
2     3      63     105  50.0  Melon
3     4      72     135  15.0    NaN